# üö© Dataframe Date/Time Type
## Ï£ºÏöî ÌÜ†ÌîΩ
1. Datetime Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ
2. Formatting & Parting
3. Time Delta
4. Datetime Ïù∏Îç±Ïä§
5. Shifting & Aggregating
## Î™©Ìëú
1. Understand nuances of the datetime types in base Python and Pandas
2. Apply custom date formats and extract datetime components from datetime data
3. Access portions of time series data and offset time series for period-by-period comparison
4. Create custom time periods and reshape data to fit periods of interest

In [1]:
import pandas as pd
import numpy as np

## 1. Times in ÌååÏù¥Ïç¨, ÌåêÎã§Ïä§
### > ÌååÏù¥Ïç¨
- Date Components + Time Components

In [2]:
from datetime import datetime

now = datetime.now()
now

datetime.datetime(2023, 8, 2, 18, 18, 1, 828975)

In [3]:
type(now)

datetime.datetime

### > ÌåêÎã§Ïä§
- astype Î©îÏÑúÎìú
    - convert strings to datetimes, Í∑∏Îü¨ÎÇò ÌåêÎã§Ïä§Í∞Ä datesÎùºÍ≥† Ïù∏ÏãùÌïòÏßÄ Î™ªÌïòÎäî Í∞íÎì§Î°ú Ïù∏Ìï¥ ÏóêÎü¨Í∞Ä Î∞úÏÉùÌïúÎã§
- to_datetime Î©îÏÑúÎìú (RECOMMENDED)
    1. errors='coerce'
    2. infer_datetime_format=True
    3. format

In [4]:
retail = pd.read_csv('./data/retail/retail_2016_2017.csv')
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [5]:
retail.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  object
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 167.8 MB

In [6]:
retail['date'] = pd.to_datetime(
    retail['date'],
    errors='coerce',
    infer_datetime_format=True
)

retail.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  datetime64[ns]
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 108.4 MB

In [7]:
retail.head()

        id       date  store_nbr      family  sales  onpromotion
0  1945944 2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945 2016-01-01          1   BABY CARE    0.0            0
2  1945946 2016-01-01          1      BEAUTY    0.0            0
3  1945947 2016-01-01          1   BEVERAGES    0.0            0
4  1945948 2016-01-01          1       BOOKS    0.0            0

### > Date Codes
- %D
- %Y (4ÏûêÎ¶¨ Ïó∞ÎèÑ)
- %y (2ÏûêÎ¶¨ Ïó∞ÎèÑ)
- %m (Ïõî; Ïà´Ïûê)
- %B (Ïõî; Î¨∏ÏûêÏó¥ Ï†ÑÏ≤¥)
- %b (Ïõî; Î¨∏ÏûêÏó¥ ÌååÌä∏)
- %d (Ïùº; Ïà´Ïûê)
- %  (ÏöîÏùº; Ïà´Ïûê)
    - 0-6 (Ïùº-ÌÜ†)
- %A (ÏöîÏùº; Î¨∏ÏûêÏó¥)
- %U (week of year)
- %j (day of year)
### > Time Codes
- %T
- %H (Ïãú; 24)
- %I (Ïãú; 12)
- %p (Ïò§Ï†Ñ, Ïò§ÌõÑ)
- %M (Î∂Ñ)
- %S (Ï¥à)
### > dt.strftime Î©îÏÑúÎìú
- object ÌÉÄÏûÖÏùÑ Î¶¨ÌÑ¥ÌïúÎã§

In [8]:
retail = pd.read_csv('./data/retail/retail_2016_2017.csv', parse_dates=['date'])
retail.head()

        id       date  store_nbr      family  sales  onpromotion
0  1945944 2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945 2016-01-01          1   BABY CARE    0.0            0
2  1945946 2016-01-01          1      BEAUTY    0.0            0
3  1945947 2016-01-01          1   BEVERAGES    0.0            0
4  1945948 2016-01-01          1       BOOKS    0.0            0

In [9]:
retail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  datetime64[ns]
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 48.3+ MB

In [10]:
retail['date'].dt.strftime('%Y').head()

0    2016
1    2016
2    2016
3    2016
4    2016
Name: date, dtype: object

In [11]:
retail['date'].dt.strftime('%y-%b-%d').head()

0    16-Jan-01
1    16-Jan-01
2    16-Jan-01
3    16-Jan-01
4    16-Jan-01
Name: date, dtype: object

### > Extract datetime components
- dt Ï†ëÍ∑ºÏûê
    - date / time ‚Üí object
    - year, month, dayofweek / hour, minute, second ‚Üí int

In [12]:
retail.head(2)

        id       date  store_nbr      family  sales  onpromotion
0  1945944 2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945 2016-01-01          1   BABY CARE    0.0            0

In [13]:
retail.assign(
    year=retail['date'].dt.year,
    month=retail['date'].dt.month,
    day=retail['date'].dt.day
).head()

,id,date,store_nbr,family,sales,onpromotion,year,month,day
0,1945944,2016-01-01,1,AUTOMOTIVE,0.0,0,2016,1,1
1,1945945,2016-01-01,1,BABY CARE,0.0,0,2016,1,1
2,1945946,2016-01-01,1,BEAUTY,0.0,0,2016,1,1
3,1945947,2016-01-01,1,BEVERAGES,0.0,0,2016,1,1
4,1945948,2016-01-01,1,BOOKS,0.0,0,2016,1,1